# IsMarkerByClass

## Description
Function IsMarkerByClass returns whether a class marker style is used for the referenced object.

```pascal
FUNCTION IsMarkerByClass(h : HANDLE) : BOOLEAN;
```

```python

def vs.IsMarkerByClass(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Returns an indication of whether the class arrow style is used for the object referenced by h.<BR>
[sd  8/19/98]

## Version
Availability: from VectorWorks8.0
## Category
* Object Attributes